Repository: Basti110/parent-quiz-app
Catalog: lib/l10n/app_*.arb
Languages: de

source: VS Mode
de: VS Modus

source: Leaderboard
de: Bestenliste

source: Settings
de: Einstellungen

source: Correct Answers
de: Richtige Antworten

source: Start Random Quiz
de: Zufälliges Quiz starten

source: Dark Mode
de: Dunkler Modus

source: Language
de: Sprache

source: Change Avatar
de: Avatar ändern

source: Logout
de: Abmelden

source: Add Friend
de: Freund hinzufügen

source: Friend Code
de: Freundescode

source: Wins
de: Siege

source: Losses
de: Niederlagen

# noFriends
source: No friends yet. Add friends to compete!
de: Noch keine Freunde. Füge Freunde hinzu, um zu konkurrieren!

source: Cancel
de: Abbrechen

source: Add
de: Hinzufügen

source: Save
de: Speichern

source: Login
de: Anmelden

source: Register
de: Registrieren

source: Password
de: Passwort

source: Display Name
de: Anzeigename

source: Confirm Password
de: Passwort bestätigen

source: Welcome Back!
de: Willkommen zurück!

source: Create Account
de: Konto erstellen

# alreadyHaveAccount
source: Already have an account?
de: Haben Sie bereits ein Konto?

# dontHaveAccount
source: Don't have an account?
de: Noch kein Konto?

source: Sign Up
de: Registrieren

# welcome
source: Welcome to Parent Quiz!
de: Willkommen bei Eltern-Quiz!

# onboardingDescription
source: Learn about parenting through fun quizzes and compete with friends!
de: Lernen Sie über Elternschaft durch lustige Quiz und treten Sie gegen Freunde an!

source: Get Started
de: Loslegen

source: Select Category
de: Kategorie auswählen

source: Select Quiz Length
de: Quiz-Länge auswählen

source: Questions
de: Fragen

source: Start
de: Starten

source: Question
de: Frage

source: Next
de: Weiter

source: Submit
de: Absenden

source: Correct!
de: Richtig!

source: Incorrect
de: Falsch

source: Explanation
de: Erklärung

source: Continue
de: Fortfahren

source: Quiz Results
de: Quiz-Ergebnisse

source: Score
de: Punktzahl

source: XP Earned
de: Verdiente EP

source: Back to Home
de: Zurück zur Startseite

source: Weekly Leaderboard
de: Wöchentliche Bestenliste

source: Rank
de: Rang

source: Player
de: Spieler

source: Points
de: Punkte

source: You
de: Du

source: Friends
de: Freunde

source: Your Friend Code
de: Dein Freundescode

source: Enter Friend Code
de: Freundescode eingeben

source: VS Mode Setup
de: VS Modus Einrichtung

source: Select Opponent
de: Gegner auswählen

# selectQuestions
source: Select Number of Questions
de: Anzahl der Fragen auswählen

source: Start Duel
de: Duell starten

source: Player 1
de: Spieler 1

source: Player 2
de: Spieler 2

# handoffDevice
source: Hand off device to {playerName}
de: Gerät an {playerName} übergeben

source: Ready
de: Bereit

source: VS Mode Results
de: VS Modus Ergebnisse

source: Winner
de: Gewinner

# tie
source: It's a Tie!
de: Unentschieden!

source: Play Again
de: Nochmal spielen

source: Streak
de: Serie

source: days
de: Tage

source: Total XP
de: Gesamt-EP

source: Select Avatar
de: Avatar auswählen

# confirmLogout
source: Are you sure you want to logout?
de: Möchtest du dich wirklich abmelden?

source: Yes
de: Ja

source: No
de: Nein

source: Error
de: Fehler

source: Loading...
de: Lädt...

source: Retry
de: Erneut versuchen

source: Tips
de: Tipps

source: Next Question
de: Nächste Frage

source: Finish Quiz
de: Quiz beenden

source: ParentQuiz
de: Eltern-Quiz

# pleaseEnterEmail
source: Please enter your email
de: Bitte gib deine E-Mail ein

# pleaseEnterValidEmail
source: Please enter a valid email
de: Bitte gib eine gültige E-Mail ein

# pleaseEnterPassword
source: Please enter your password
de: Bitte gib dein Passwort ein

# pleaseEnterName
source: Please enter your name
de: Bitte gib deinen Namen ein

# nameTooShort
source: Name must be at least 2 characters
de: Name muss mindestens 2 Zeichen lang sein

# passwordTooShort
source: Password must be at least 6 characters
de: Passwort muss mindestens 6 Zeichen lang sein

# pleaseConfirmPassword
source: Please confirm your password
de: Bitte bestätige dein Passwort

source: Passwords do not match
de: Passwörter stimmen nicht überein

source: Welcome to ParentQuiz
de: Willkommen bei Eltern-Quiz

# onboardingWelcomeDescription
source: Learn evidence-based parenting through fun, bite-sized quizzes
de: Lerne evidenzbasierte Elternschaft durch lustige, mundgerechte Quizzes

source: Earn XP & Level Up
de: EP verdienen & aufsteigen

# onboardingXpDescription
source: Answer questions correctly, maintain streaks, and track your progress
de: Beantworte Fragen richtig, halte Serien aufrecht und verfolge deinen Fortschritt

source: Compete with Friends
de: Mit Freunden konkurrieren

# onboardingFriendsDescription
source: Add friends, compare scores on leaderboards, and challenge them in VS Mode
de: Füge Freunde hinzu, vergleiche Punktzahlen auf Bestenlisten und fordere sie im VS Modus heraus

source: Back
de: Zurück

source: Skip
de: Überspringen

source: Select all that apply
de: Wählen Sie alle zutreffenden aus

source: Select one answer
de: Wählen Sie eine Antwort

# pleaseSelectAnswer
source: Please select an answer
de: Bitte wähle eine Antwort

source: Submit Answer
de: Antwort absenden

source: Show tip
de: Tipp anzeigen

source: Tip
de: Tipp

source: Got it
de: Verstanden

source: User not authenticated
de: Benutzer nicht authentifiziert

# noQuestionsAvailable
source: No questions available for this category
de: Keine Fragen für diese Kategorie verfügbar

# errorLoadingQuestions
source: Error loading questions: {error}
de: Fehler beim Laden der Fragen: {error}

# errorFinishingQuiz
source: Error finishing quiz: {error}
de: Fehler beim Beenden des Quiz: {error}

source: Quiz Complete!
de: Quiz abgeschlossen!

source: Perfect Score! 🎉
de: Perfekte Punktzahl! 🎉

source: Excellent Work! 🌟
de: Ausgezeichnete Arbeit! 🌟

source: Good Job! 👍
de: Gut gemacht! 👍

source: Keep Learning! 📚
de: Weiter lernen! 📚

source: Your Score
de: Deine Punktzahl

source: {percent}% Correct
de: {percent}% Richtig

source: XP Breakdown:
de: EP-Aufschlüsselung:

# correctAnswersXp
source: Correct answers
de: Richtige Antworten

source: Incorrect (with explanation)
de: Falsch (mit Erklärung)

source: Session bonus
de: Sitzungsbonus

source: Perfect bonus
de: Perfektbonus

source: All correct!
de: Alle richtig!

source: Current Streak
de: Aktuelle Serie

# daysCount
source: {count} Days
de: {count} Tage

# longest
source: Longest: {count} days
de: Längste: {count} Tage

source: Error loading user data
de: Fehler beim Laden der Benutzerdaten

source: View Source
de: Quelle anzeigen

source: Could not open link
de: Link konnte nicht geöffnet werden

source: Please log in to view leaderboard
de: Bitte melde dich an, um die Bestenliste anzuzeigen

# noPlayersYet
source: No players on the leaderboard yet
de: Noch keine Spieler auf der Bestenliste

# errorLoadingLeaderboard
source: Error loading leaderboard: {error}
de: Fehler beim Laden der Bestenliste: {error}

source: No friends yet
de: Noch keine Freunde

# addFriendsToSeeRankings
source: Add friends to see their rankings
de: Fügen Sie Freunde hinzu, um ihre Ranglisten zu sehen

# addFriendsButton
source: Add Friends
de: Freunde hinzufügen

# errorLoadingFriendsLeaderboard
source: Error loading friends leaderboard: {error}
de: Fehler beim Laden der Freunde-Bestenliste: {error}

source: Your Rank
de: Dein Rang

source: Weekly XP
de: Wöchentliche EP

source: XP
de: EP

source: Exit Quiz
de: Quiz beenden

# exitQuizConfirmation
source: Are you sure you want to exit? Your progress will be lost.
de: Möchtest du wirklich beenden? Dein Fortschritt geht verloren.

source: Daily Goal
de: Tagesziel

source: Questions per day
de: Fragen pro Tag

# dailyGoalDescription
source: Set how many questions you want to answer each day
de: Lege fest, wie viele Fragen du jeden Tag beantworten möchtest

# dailyGoalUpdated
source: Daily goal updated successfully
de: Tagesziel erfolgreich aktualisiert

# invalidDailyGoal
source: Daily goal must be between 1 and 50
de: Tagesziel muss zwischen 1 und 50 liegen

source: Statistics
de: Statistiken

source: Overall Progress
de: Gesamtfortschritt

source: Questions Answered
de: Beantwortete Fragen

source: Questions Mastered
de: Gemeisterte Fragen

source: Questions Seen
de: Gesehene Fragen

source: By Category
de: Nach Kategorie

source: Answered
de: Beantwortet

source: Mastered
de: Gemeistert

source: Progress
de: Fortschritt

# noCategoryStatistics
source: No category statistics yet. Start answering questions!
de: Noch keine Kategoriestatistiken. Beginnen Sie mit dem Beantworten von Fragen!

source: Failed to load statistics
de: Statistiken konnten nicht geladen werden

source: Please try again
de: Bitte versuchen Sie es erneut

# errorStartingVsMode
source: Error starting VS Mode: {error}
de: Fehler beim Starten des VS Modus: {error}

# errorLoadingDuel
source: Error loading duel: {error}
de: Fehler beim Laden des Duells: {error}

# errorSubmittingAnswer
source: Error submitting answer: {error}
de: Fehler beim Übermitteln der Antwort: {error}

# errorCompletingDuel
source: Error completing duel: {error}
de: Fehler beim Abschließen des Duells: {error}

# errorAcceptingDuel
source: Failed to accept duel: {error}
de: Duell konnte nicht angenommen werden: {error}

# errorDecliningDuel
source: Failed to decline duel: {error}
de: Duell konnte nicht abgelehnt werden: {error}

# errorUpdatingStats
source: Error updating stats: {error}
de: Fehler beim Aktualisieren der Statistiken: {error}

# errorLoadingResults
source: Error loading results: {error}
de: Fehler beim Laden der Ergebnisse: {error}

# errorLoadingCategories
source: Error loading categories: {error}
de: Fehler beim Laden der Kategorien: {error}

# errorLoadingFriends
source: Error loading friends: {error}
de: Fehler beim Laden der Freunde: {error}

# errorAcceptingFriendRequest
source: Failed to accept friend request: {error}
de: Freundschaftsanfrage konnte nicht angenommen werden: {error}

# errorDecliningFriendRequest
source: Failed to decline friend request: {error}
de: Freundschaftsanfrage konnte nicht abgelehnt werden: {error}

# errorCreatingDuel
source: Failed to create duel: {error}
de: Duell konnte nicht erstellt werden: {error}

# errorAddingFriend
source: Failed to add friend. Please try again.
de: Freund konnte nicht hinzugefügt werden. Bitte versuchen Sie es erneut.

# pleaseSelectCategory
source: Please select a category
de: Bitte wähle eine Kategorie

source: Please enter Player A name
de: Bitte gib den Namen von Spieler A ein

source: Please enter Player B name
de: Bitte gib den Namen von Spieler B ein

# pleaseEnterFriendCode
source: Please enter a friend code
de: Bitte gib einen Freundescode ein

# friendCodeLength
source: Friend code must be 6-8 characters
de: Freundescode muss 6-8 Zeichen lang sein

# noUserFoundWithCode
source: No user found with this friend code
de: Kein Benutzer mit diesem Freundescode gefunden

# cannotAddYourself
source: You cannot add yourself as a friend
de: Du kannst dich nicht selbst als Freund hinzufügen

# alreadyFriends
source: You are already friends with this user
de: Du bist bereits mit diesem Benutzer befreundet

# dialogTitleExitDuel
source: Exit Duel?
de: Duell beenden?

# dialogContentExitDuel
source: Your progress will be saved and you can continue later.
de: Dein Fortschritt wird gespeichert und du kannst später fortfahren.

# dialogTitleAddFriend
source: Add Friend
de: Freund hinzufügen

# dialogTitleDuelChallenge
source: Duel Challenge
de: Duell-Herausforderung

# challengeNoLongerAvailable
source: This challenge is no longer available
de: Diese Herausforderung ist nicht mehr verfügbar

# buttonGoBack
source: Go Back
de: Zurück

# buttonHome
source: Home
de: Startseite

# buttonAcceptChallenge
source: Accept Challenge
de: Herausforderung annehmen

# buttonDeclineChallenge
source: Decline
de: Ablehnen

# buttonExit
source: Exit
de: Beenden

# buttonAccept
source: Accept
de: Annehmen

# buttonDecline
source: Decline
de: Ablehnen

# screenTitleVsMode
source: VS Mode
de: VS Modus

# screenTitleDuel
source: Duel
de: Duell

# screenTitleDuelResults
source: Duel Results
de: Duell-Ergebnisse

# statusFriendRequestSent
source: Friend request sent to {name}!
de: Freundschaftsanfrage an {name} gesendet!

# statusDuelChallengeSent
source: Duel challenge sent to {name}!
de: Duell-Herausforderung an {name} gesendet!

# statusDuelDeclined
source: Duel declined
de: Duell abgelehnt

# statusFriendCodeCopied
source: Friend code copied to clipboard
de: Freundescode in die Zwischenablage kopiert

# statusNowFriends
source: You are now friends with {name}!
de: Du bist jetzt mit {name} befreundet!

# statusFriendRequestDeclined
source: Friend request declined
de: Freundschaftsanfrage abgelehnt

# statusFriendAdded
source: {name} added as friend!
de: {name} als Freund hinzugefügt!

# questionsLabel
source: Questions
de: Fragen

# timeLabel
source: Time
de: Zeit

# winnerLabel
source: Winner
de: Gewinner

# answerAtOwnPace
source: Answer at your own pace
de: Antworte in deinem eigenen Tempo

source: Highest score wins
de: Höchste Punktzahl gewinnt

# passDeviceTo
source: Pass device to {playerName}
de: Gerät an {playerName} übergeben

# startPlayerTurn
source: START {playerName}'S TURN
de: {playerName}S ZUG STARTEN

# duelWith
source: Duel with {playerName}
de: Duell mit {playerName}

# questionProgress
source: Question {current} / {total}
de: Frage {current} / {total}

# youLabel
source: You
de: Du

source: No categories available
de: Keine Kategorien verfügbar

source: Please log in to view friends
de: Bitte melde dich an, um Freunde anzuzeigen

source: day streak
de: Tage-Serie

source: Leading
de: Führend

source: Trailing
de: Rückständig

source: Tied
de: Unentschieden

source: Head-to-Head Record
de: Direkter Vergleich

source: Ties
de: Unentschieden

# pleaseSelectAvatar
source: Please select an avatar
de: Bitte wähle einen Avatar

# friendRequests
source: Friend Requests ({count})
de: Freundschaftsanfragen ({count})

source: Wants to be your friend
de: Möchte Ihr Freund werden

# yourFriendCodeLabel
source: Your Friend Code
de: Ihr Freundescode

# shareCodeWithFriends
source: Share this code with friends so they can add you
de: Teile diesen Code mit Freunden, damit sie dich hinzufügen können

# noFriendsYetTitle
source: No friends yet
de: Noch keine Freunde

# addFriendsUsingCode
source: Add friends using their friend code
de: Freunde mit ihrem Freundescode hinzufügen

source: View Results
de: Ergebnisse anzeigen

source: Send Challenge
de: Herausforderung senden

# duelWithPlayerCompleted
source: Duel with {playerName} completed!
de: Duell mit {playerName} abgeschlossen!

# waitingForPlayerToComplete
source: Waiting for {playerName} to complete
de: Warten auf {playerName} zum Abschluss

# duelWithPlayerReady
source: Duel with {playerName} is ready!
de: Duell mit {playerName} ist bereit!

# duelCompletedTapBanner
source: Duel completed - tap banner to view results
de: Duell abgeschlossen - Banner antippen für Ergebnisse

source: Waiting for opponent to complete
de: Warten auf Gegner zum Abschluss

# duelReadyTapBanner
source: Duel ready - tap banner to start
de: Duell bereit - Banner antippen zum Starten

# tapBannerToAcceptDecline
source: Tap banner to accept or decline
de: Banner antippen zum Annehmen oder Ablehnen

# challengeSentWaiting
source: Challenge sent - waiting for response
de: Herausforderung gesendet - warten auf Antwort

# viewResultsTooltip
source: View results
de: Ergebnisse anzeigen

# startDuelTooltip
source: Start duel
de: Duell starten

source: Challenge to duel
de: Zum Duell herausfordern

source: Challenge pending
de: Herausforderung ausstehend

source: Waiting for opponent
de: Warten auf Gegner

source: Error loading duel status
de: Fehler beim Laden des Duell-Status

# challengePlayerQuestion
source: Challenge {playerName}?
de: {playerName} herausfordern?

# fiveQuestionsOwnPace
source: 5 questions • Answer at your own pace
de: 5 Fragen • Antworten Sie in Ihrem eigenen Tempo

# enterFriendCodeToAdd
source: Enter your friend's code to add them
de: Geben Sie den Code Ihres Freundes ein, um ihn hinzuzufügen

# friendCodeLabel
source: Friend Code
de: Freundescode

# friendCodeHint
source: e.g., ABC123
de: z.B. ABC123

# friendRequestAlreadySent
source: Friend request already sent to this user
de: Freundschaftsanfrage bereits an diesen Benutzer gesendet

# playerALabel
source: Player A
de: Spieler A

# playerBLabel
source: Player B
de: Spieler B

source: Questions per Player
de: Fragen pro Spieler

# questionsLowercase
source: questions
de: fragen

source: Avatar saved
de: Avatar gespeichert

# authenticationError
source: Authentication failed. Please check your credentials.
de: Authentifizierung fehlgeschlagen. Bitte überprüfe deine Anmeldedaten.

# registrationError
source: Registration failed. Please try again.
de: Registrierung fehlgeschlagen. Bitte versuche es erneut.

source: Loading categories...
de: Kategorien werden geladen...

source: Loading questions...
de: Fragen werden geladen...

source: Loading results...
de: Ergebnisse werden geladen...

source: Loading friends...
de: Freunde werden geladen...

source: Loading leaderboard...
de: Bestenliste wird geladen...

source: Loading statistics...
de: Statistiken werden geladen...

source: No data available
de: Keine Daten verfügbar

# emptyFriendsList
source: Your friends list is empty
de: Ihre Freundesliste ist leer

# emptyLeaderboard
source: No players on the leaderboard
de: Keine Spieler auf der Bestenliste

source: Saving changes...
de: Änderungen werden gespeichert...

# changesSaved
source: Changes saved successfully
de: Änderungen erfolgreich gespeichert

# operationFailed
source: Operation failed. Please try again.
de: Vorgang fehlgeschlagen. Bitte versuche es erneut.

# networkError
source: Network error. Please check your connection.
de: Netzwerkfehler. Bitte überprüfe deine Verbindung.

# unexpectedError
source: An unexpected error occurred
de: Ein unerwarteter Fehler ist aufgetreten

# dailyGoalValidationError
source: Daily goal must be between 1 and 50
de: Tagesziel muss zwischen 1 und 50 liegen

# passAndPlayDuel
source: Pass & Play Duel
de: Pass & Play Duell

# competeWithFriendSameDevice
source: Compete with a friend on the same device
de: Konkurrieren Sie mit einem Freund auf demselben Gerät

source: Player Names
de: Spielernamen

source: {score} correct
de: {score} richtig

source: Perfect Tie!
de: Perfektes Unentschieden!

source: {winner} Wins!
de: {winner} gewinnt!

source: Won by speed!
de: Durch Geschwindigkeit gewonnen!

source: Duel Points Earned
de: Duell-Punkte verdient

# duelPointsTie
source: +1 Duel Point (Tie)
de: +1 Duell-Punkt (Unentschieden)

# duelPointsWin
source: +3 Duel Points (Win)
de: +3 Duell-Punkte (Sieg)

# duelPointsLoss
source: No Duel Points (Loss)
de: Keine Duell-Punkte (Niederlage)

source: You Won!
de: Du hast gewonnen!

source: You Lost
de: Du hast verloren

# resultsAvailableWhenBothComplete
source: Results will be available when both players complete the duel
de: Ergebnisse sind verfügbar, wenn beide Spieler das Duell abgeschlossen haben

source: Question Breakdown
de: Fragen-Aufschlüsselung

source: DONE
de: FERTIG

# challengesYou
source: {playerName} challenges you!
de: {playerName} fordert Sie heraus!

# fiveQuestions
source: 5 questions
de: 5 Fragen
